YuanquanCheng/Source/STM32接入阿里云(FreeRTOS)/HARDWARE/WIFI/wifi.c
	printf("准备设置STA模式\r\n");                  //串口提示数据
	if(WiFi_SendCmd("AT+CWMODE=1",50)){                //设置STA模式，100ms超时单位，总计5s超时时间
		printf("设置STA模式失败，准备重启\r\n");    //返回非0值，进入if，串口提示数据
		return 2;                                      //返回2
	}else printf("设置STA模式成功\r\n");            //串口提示数据
	
	if(wifi_mode==0){                                      //如果联网模式=0：SSID和密码写在程序里 
		printf("准备取消自动连接\r\n");                 //串口提示数据
		if(WiFi_SendCmd("AT+CWAUTOCONN=0",50)){            //取消自动连接，100ms超时单位，总计5s超时时间
			printf("取消自动连接失败，准备重启\r\n");   //返回非0值，进入if，串口提示数据
			return 3;                                      //返回3
		}else printf("取消自动连接成功\r\n");           //串口提示数据
				
		printf("准备连接路由器\r\n");                   //串口提示数据	
		if(WiFi_JoinAP(30)){                               //连接路由器,1s超时单位，总计30s超时时间
			printf("连接路由器失败，准备重启\r\n");     //返回非0值，进入if，串口提示数据
			return 4;                                      //返回4	
		}else printf("连接路由器成功\r\n");             //串口提示数据			
	}else{                                                 //如果联网模式=1：Smartconfig方式,用APP发送
		if(KEY2_IN_STA==0){                                    //如果此时K2是按下的
			printf("准备设置自动连接\r\n");                 //串口提示数据
			if(WiFi_SendCmd("AT+CWAUTOCONN=1",50)){            //设置自动连接，100ms超时单位，总计5s超时时间
				printf("设置自动连接失败，准备重启\r\n");   //返回非0值，进入if，串口提示数据
				return 3;                                      //返回3
			}else printf("设置自动连接成功\r\n");           //串口提示数据	
			
			printf("准备开启Smartconfig\r\n");              //串口提示数据
			if(WiFi_SendCmd("AT+CWSTARTSMART",50)){            //开启Smartconfig，100ms超时单位，总计5s超时时间
				printf("开启Smartconfig失败，准备重启\r\n");//返回非0值，进入if，串口提示数据
				return 4;                                      //返回4
			}else printf("开启Smartconfig成功\r\n");        //串口提示数据

			printf("请使用APP软件传输密码\r\n");            //串口提示数据
			if(WiFi_Smartconfig(60)){                          //APP软件传输密码，1s超时单位，总计60s超时时间
				printf("传输密码失败，准备重启\r\n");       //返回非0值，进入if，串口提示数据
				return 5;                                      //返回5
			}else printf("传输密码成功\r\n");               //串口提示数据

			printf("准备关闭Smartconfig\r\n");              //串口提示数据
			if(WiFi_SendCmd("AT+CWSTOPSMART",50)){             //关闭Smartconfig，100ms超时单位，总计5s超时时间
				printf("关闭Smartconfig失败，准备重启\r\n");//返回非0值，进入if，串口提示数据
				return 6;                                      //返回6
			}else printf("关闭Smartconfig成功\r\n");        //串口提示数据
		}else{                                                 //反之，此时K2是没有按下
			printf("等待连接路由器\r\n");                   //串口提示数据	
			if(WiFi_WaitAP(30)){                               //等待连接路由器,1s超时单位，总计30s超时时间
				printf("连接路由器失败，准备重启\r\n");     //返回非0值，进入if，串口提示数据
				return 7;                                      //返回7	
			}else printf("连接路由器成功\r\n");             //串口提示数据					
		}
	}
	
	printf("准备获取IP地址\r\n");                   //串口提示数据
	if(WiFi_GetIP(50)){                                //准备获取IP地址，100ms超时单位，总计5s超时时间
		printf("获取IP地址失败，准备重启\r\n");     //返回非0值，进入if，串口提示数据
		return 10;                                     //返回10
	}else printf("获取IP地址成功\r\n");             //串口提示数据
	
	printf("准备开启透传\r\n");                     //串口提示数据
	if(WiFi_SendCmd("AT+CIPMODE=1",50)){               //开启透传，100ms超时单位，总计5s超时时间
		printf("开启透传失败，准备重启\r\n");       //返回非0值，进入if，串口提示数据
		return 11;                                     //返回11
	}else printf("开启透传成功\r\n");               //串口提示数据
	
	printf("准备关闭多路连接\r\n");                 //串口提示数据
	if(WiFi_SendCmd("AT+CIPMUX=0",50)){                //关闭多路连接，100ms超时单位，总计5s超时时间
		printf("关闭多路连接失败，准备重启\r\n");   //返回非0值，进入if，串口提示数据
		return 12;                                     //返回12
	}else printf("关闭多路连接成功\r\n");           //串口提示数据

	return 0;                                          //正确返回0	
}


/*-------------------------------------------------*/
/*函数名：发送数据给服务器                         */
/*参  数：sendbuf：要发送的数据地址                */
/*返回值：0：正确   其他：错误                     */
/*-------------------------------------------------*/
char WiFi_Send(char *sendbuf)
{
    //检查输入数据是否有效
    if(sendbuf != NULL)
    {
        WiFi_printf("%s\r\n",sendbuf);              //通过串口发送数据到ESP8266
        Delay_Ms(50);
        return 0;
    }
    else
    {
        return 1;
    }
}

/*-------------------------------------------------*/
/*函数名：接收服务器回发数据                       */
/*参  数：recvbuf：接收数据存放地址                */
/*        len：接收的数据长度                      */
/*        timeout：等待接收时间                    */
/*返回值：0：正确   其他：错误                     */
/*-------------------------------------------------*/
char WiFi_Recv(char *recvbuf, int len, int timeout)
{   
    //检查接收地址是否有效
    if(recvbuf != NULL)
    {
        //检查接收数据长度是否有效
        if(len <= 0)
        {
            return 2;
        }
        else
        {
            //检查等待时间
            if(timeout < 10)
            {
                timeout = 10;
            }

            WiFi_RxCounter=0;                       //WiFi接收数据量变量清零                        
            memset(WiFi_RX_BUF,0,WiFi_RXBUFF_SIZE); //清空WiFi接收缓冲区
            WifiMsg.U2_RxCompleted=0;
            while((!WifiMsg.U2_RxCompleted) && timeout)
            {
                --timeout;
                Delay_Ms(10);
            }
            if(WifiMsg.U2_RxCompleted)
            {
                //复制指定长度数据到接收地址
                strncpy(recvbuf, WiFi_RX_BUF, len-1);
                recvbuf[len-1]='\0';        //确保数据不会出现错误
                memset(WiFi_RX_BUF,0,WiFi_RXBUFF_SIZE); //清空WiFi接收缓冲区
                return 0;
            }
            return 4;
        }
    }
    else
    {
        return 1;
    }
}


